{
    "name": "shipwrecks",
    "values": [
        {
            "name": "Survey Woes",
            "header": "Captain's Log [10.5.3122]:",
            "content": "We have once again been notified of an attempt to terminate our ongoing survey mission. However, as usual we have managed to convince the upper brass to allow it to continue. Our scans continue to show incorrect data, as if this sector is from another galaxy entirely. Something dramatic clearly happened here...\nNoting some strange \"tear marks\" and \"dents\" across the surface, our chief engineer hypothesized that something was desperately trying to get into it... or perhaps get out of it.",
            "type": "LOG",
            "weight": 0.2,
            "conditions": []
        },
        {
            "name": "Mysterious Anomaly",
            "header": "Captain's Log [10.17.3122]:",
            "content": "We encountered another strange anomaly today. It appears to be a small capsule, the size of a child. Yet it's radar signature would indicate that of a colossal battleship, gigantic in size.\nEither case, we opened it easily, but found nothing. Strangely enough, the massive radar signature we had detected earlier disappeared after we opened it.",
            "type": "LOG",
            "weight": 0.15,
            "conditions": []
        },
        {
            "name": "Strange Signal",
            "header": "Captain's Log [10.25.3122]:",
            "content": "We have detected a strange signal coming from the planet below. It appears to be some sort of distress call, but it's not coming from any known language. We have sent a team down to investigate, but they have not returned yet...",
            "type": "LOG",
            "weight": 0.15,
            "conditions": [
                {
                    "name": "sector-type",
                    "value": "PLANET"
                }
            ]
        },
        {
            "name": "Perilous Journey",
            "header": "Captain's Log [11.15.3117]:",
            "content": "Captain’s Log [11.15.3117]: \nIf there was one thing I’ve despised most about our journeys, it has to be the constant harassment from raiders. I knew this region of the galaxy was filled with criminal scum, but I assumed the Guild would provide us escorts.\n\nThe only reason we are still alive is due to my head diplomat, who is incredibly gifted at her job. Even so, we have still had to hand over credits occasionally to some of the more persistent pirates.\n\nThe problem is that these bandits are only interested in profit and some excitement. I would hate to believe that someone actually views these sorts of ruffians as potential business partners. Yet I have heard rumors of corruption and even some collaboration in parts of the Guild’s upper command…",
            "type": "LOG",
            "weight": 0.8,
            "conditions": [
                {
                    "name": "adjacent-sector-contains",
                    "value": "entity:station[-2]"
                }
            ]
        },
        {
            "name": "Space-Borne Virus",
            "header": "Captain's Log [8.10.2122]:",
            "content": "Our medical bay is once again full. Someone has brought another alien virus on board, and it is rampaging through the rest of our fleet. The doctors are trying to work to contain it, but the best they can do is keep it from killing everybody. I just spoke to Captains Vila and Raus, together we are the only 3 captains still untouched by the virus in our fleet. They arrived on the asteroid base where the virus started in hopes of discovering anything new, but time is running out. Fleet Command is either unwilling or unable to lend assistance, and I don’t think we can rely on Dr. Rahamadal’s so called “miracle cure” that he supposedly is working on. I am doing everything I can to prepare the crew for what might be a harsh few months ahead…",
            "type": "LOG",
            "weight": 0.27,
            "conditions": []
        },
        {
            "name": "Frustrating Response",
            "header": "Communication Log [3.12.3119]:",
            "content": "[ECG-Falchion] Fleet command, we have repeatedly asked for a fresh supply of coils for the repair work. We cannot complete the work without it, and if you expect us to finish the work before we run out we can't be responsible for the damage it might cause.\n\n[Fleet Command] Captain Jan we understand your concerns, however we cannot spare the material resources right now.\n\n[ECG-Falchion] Bullshit! I know where you’ve been funneling the coils, and it’s illegal according to the Galactic Concordat! Give me my damn coils or don’t be surprised if someone leaks this corruption to the press!\n\n[Fleet Command] Hello, this is Service Bot 0319C, I will attempt to answer any questions you might have.\n\n[ECG-Falchion] Don’t give me the service bot treatment! I want to speak to an actual person dammit!",
            "type": "COMMUNICATION",
            "weight": 0.2,
            "conditions": []
        }
    ]
}
